app/controllers/comments_controller.rb

INSERT INTO `comments` (`content`, `user_id`, `prototype_id`, `created_at`, `updated_at`) VALUES ('コメント', 1, 1, '2023-06-05 05:37:34.353254', '2023-06-05 05:37:34.353254')
---
  def create
    @comment = Comment.new(comment_params)
    if @comment.save