app/controllers/prototypes_controller.rb

  def index
    @prototypes = Prototype.includes(:user)
---
SELECT `prototypes`.* FROM `prototypes`

  def show
    @prototype = Prototype.find(params[:id])
    @comment = Comment.new
    @comments = @prototype.comments.includes(:user)
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`prototype_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def update
    @prototype = Prototype.find(params[:id])
    if @prototype.update(prototype_params)
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 2 LIMIT 1
UPDATE `prototypes` SET `prototypes`.`title` = '名称2-2', `prototypes`.`updated_at` = '2023-06-05 05:37:47.374922' WHERE `prototypes`.`id` = 2

  def destroy
    @prototype = Prototype.find(params[:id])
    if @prototype.destroy
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 2 LIMIT 1
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 2